<a href="https://colab.research.google.com/github/sureshmecad/Google-Colab/blob/master/1_Missing_Values_replace_zero_nan.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

##### **1) Finding zeros in dataframe**

##### **2) Replace Zeros with NaN**

      - replace()

##### **3) Replace NaN Values with Zeros**

      - fillna()
      - replace()

##### **4)Replace NA values with mode of a DataFrame column**

     df['column'].fillna(df['column'].mode()[0], inplace=True)

##### **5) Replace NA values with mean of a DataFrame column**

     df['column'].fillna((df['column'].mean()), inplace=True)

----------------

### **1) Replace Zeros with NaN**

Download the dataset from https://github.com/arupbhunia/Data-Pre-processing/blob/master/datasets/diabetes.csv

Dataset used - **diabetes.csv**

Download instruction: go to the given link--->click **raw** button on top right corner---->Press **Ctrl+S** -->save it as **.csv file.**

In [1]:
from google.colab import files
uploaded = files.upload()

Saving diabetes.csv to diabetes.csv

In [3]:
import numpy as np
import pandas as pd

In [4]:
# create a data frame named diabetes and load the csv file
diabetes = pd.read_csv("diabetes.csv")
#print the head 
diabetes.head()

   Pregnancies  Glucose  BloodPressure  ...  DiabetesPedigreeFunction  Age  Outcome
0            6      148             72  ...                     0.627   50        1
1            1       85             66  ...                     0.351   31        0
2            8      183             64  ...                     0.672   32        1
3            1       89             66  ...                     0.167   21        0
4            0      137             40  ...                     2.288   33        1

[5 rows x 9 columns]

#### **a) Finding zeros in dataframe column wise**

In [10]:
# will summarize the number of zeroes in each column
(diabetes == 0).sum(axis=0)

# (diabetes == 0).sum()        --->  Column wise

# (diabetes == 0).sum(axis=0)  --->  Where axis 0 specifies that sum will operate on columns.

# (diabetes == 0).sum(axis=1)  --->  Where axis 1 specifies that sum will operate on rows.

Pregnancies                 111
Glucose                       5
BloodPressure                35
SkinThickness               227
Insulin                     374
BMI                          11
DiabetesPedigreeFunction      0
Age                           0
Outcome                     500
dtype: int64

In [7]:
# will show the total number of zeroes in the whole dataframe
(diabetes == 0).sum().sum()

1263

In [8]:
# using Numpy
print(np.count_nonzero(diabetes==0))

1263

- We know that some features **can not be zero(e.g. a person's blood pressure can not be 0)** hence we will impute **zeros** with **nan** value in these features.

#### **b) Replace zero with nan**

- **Glucose, BloodPressure, SkinThickness, Insulin, and BMI** features **cannot be zero**, we will impute **zeros** with **nan** value in these features**

**1) Replace zero with nan for single column**

     df['amount'] = df['amount'].replace(0, np.nan)

**2) Replace zero with nan for multiple columns**

     cols = ["Weight","Height","BootSize","SuitSize","Type"]

     df[cols] = df[cols].replace(['0', 0], np.nan)

**3) in column of dataframe, replace zero with blanks**
   
     df['amount'].replace(['0', '0.0'], '', inplace=True)

In [17]:
cols = ["Glucose", "BloodPressure", "SkinThickness", "Insulin", "BMI"]
diabetes[cols] = diabetes[cols].replace(['0', 0], np.nan)

In [18]:
# Display the no of null values in each feature
diabetes.isnull().sum()

Pregnancies                   0
Glucose                       5
BloodPressure                35
SkinThickness               227
Insulin                     374
BMI                          11
DiabetesPedigreeFunction      0
Age                           0
Outcome                       0
dtype: int64

------------------

##### **Question 1**
#### **Count how many zero values in a column pandas**

In [39]:
# Create Pandas dataframe:
import pandas as pd

df = pd.DataFrame({'a':[1,0,0,1,3], 
                  'b':[0,0,1,0,1], 
                  'c':[0,0,0,0,0]})

df

   a  b  c
0  1  0  0
1  0  0  0
2  0  1  0
3  1  0  0
4  3  1  0

**both gives same results**

**(df == 0).sum()        --->  Column wise**

**(df == 0).sum(axis=0)  --->  Where axis 0 specifies that sum will operate on columns**

In [40]:
(df == 0).sum()

a    2
b    3
c    5
dtype: int64

**(df == 0).sum(axis=1)  --->  Where axis 1 specifies that sum will operate on rows**

In [41]:
(df == 0).sum(axis=1)

0    2
1    3
2    2
3    2
4    1
dtype: int64

#### **count number of zeros in a column**

In [42]:
(df['a'] == 0).sum()

2

#### **df count zeros**

In [43]:
df.astype(bool).sum(axis=0)

a    3
b    2
c    0
dtype: int64

-----------------------

#### **2) Replace NaN Values with Zeros**

##### **Methods to replace NaN values with zeros in Pandas DataFrame:**

**fillna()**

- The **fillna()** function is used to fill **NA/NaN** values using the specified method.

**replace()**

- The **dataframe.replace()** function in Pandas can be defined as a simple method used to replace a **string, regex, list, dictionary** etc. in a DataFrame.

##### **Steps to replace NaN values:**

- **For a single column using Pandas:**

       df['DataFrame Column'] = df['DataFrame Column'].fillna(0)

- **For a single column using NumPy:**

       df['DataFrame Column'] = df['DataFrame Column'].replace(np.nan, 0)

- **For an entire DataFrame using Pandas:**

       df.fillna(0)

- **For an entire DataFrame using NumPy:**

       df.replace(np.nan, 0)

- **Replace NA values with mode of a DataFrame column**

       df['column'].fillna(df['column'].mode()[0], inplace=True)

- **Replace NA values with mean of a DataFrame column**

       df['column'].fillna((df['column'].mean()), inplace=True)

##### **Method 1: Using fillna() function for a single column**

In [31]:
# importing libraries
import pandas as pd
import numpy as np
  
nums = {'Set_of_Numbers': [2, 3, 5, 7, 11, 13, 
                           np.nan, 19, 23, np.nan]}
  
# Create the dataframe
df1 = pd.DataFrame(nums, columns =['Set_of_Numbers'])
  
# print the DataFrame
df1

   Set_of_Numbers
0             2.0
1             3.0
2             5.0
3             7.0
4            11.0
5            13.0
6             NaN
7            19.0
8            23.0
9             NaN

In [32]:
# Apply the function
df1['Set_of_Numbers'] = df1['Set_of_Numbers'].fillna(0)
  
# print the DataFrame
df1

   Set_of_Numbers
0             2.0
1             3.0
2             5.0
3             7.0
4            11.0
5            13.0
6             0.0
7            19.0
8            23.0
9             0.0

##### **Method 2: Using replace() function for a single column**

In [33]:
# importing libraries
import pandas as pd
import numpy as np
  
nums = {'Car Model Number': [223, np.nan, 237, 195, np.nan,
                             575, 110, 313, np.nan, 190, 143, 
                             np.nan],
       'Engine Number': [4511, np.nan, 7570, 1565, 1450, 3786, 
                         2995, 5345, 7777, 2323, 2785, 1120]}
  
# Create the dataframe
df2 = pd.DataFrame(nums, columns =['Car Model Number', 'Engine Number'])
  
# print the DataFrame
df2

    Car Model Number  Engine Number
0              223.0         4511.0
1                NaN            NaN
2              237.0         7570.0
3              195.0         1565.0
4                NaN         1450.0
5              575.0         3786.0
6              110.0         2995.0
7              313.0         5345.0
8                NaN         7777.0
9              190.0         2323.0
10             143.0         2785.0
11               NaN         1120.0

In [34]:
# Apply the function
df2['Car Model Number'] = df2['Car Model Number'].replace(np.nan, 0)
  
# print the DataFrame
df2

    Car Model Number  Engine Number
0              223.0         4511.0
1                0.0            NaN
2              237.0         7570.0
3              195.0         1565.0
4                0.0         1450.0
5              575.0         3786.0
6              110.0         2995.0
7              313.0         5345.0
8                0.0         7777.0
9              190.0         2323.0
10             143.0         2785.0
11               0.0         1120.0

##### **Method 3: Using fillna() function for the whole dataframe**

In [35]:
# importing libraries
import pandas as pd
import numpy as np
  
nums = {'Number_set_1': [0, 1, 1, 2, 3, 5, np.nan,
                         13, 21, np.nan],
       'Number_set_2': [3, 7, np.nan, 23, 31, 41, 
                        np.nan, 59, 67, np.nan],
       'Number_set_3': [2, 3, 5, np.nan, 11, 13, 17,
                        19, 23, np.nan]}
  
# Create the dataframe
df3 = pd.DataFrame(nums)
  
# print the DataFrame
df3

   Number_set_1  Number_set_2  Number_set_3
0           0.0           3.0           2.0
1           1.0           7.0           3.0
2           1.0           NaN           5.0
3           2.0          23.0           NaN
4           3.0          31.0          11.0
5           5.0          41.0          13.0
6           NaN           NaN          17.0
7          13.0          59.0          19.0
8          21.0          67.0          23.0
9           NaN           NaN           NaN

In [36]:
# Apply the function
df3 = df3.fillna(0)
  
# print the DataFrame
df3

   Number_set_1  Number_set_2  Number_set_3
0           0.0           3.0           2.0
1           1.0           7.0           3.0
2           1.0           0.0           5.0
3           2.0          23.0           0.0
4           3.0          31.0          11.0
5           5.0          41.0          13.0
6           0.0           0.0          17.0
7          13.0          59.0          19.0
8          21.0          67.0          23.0
9           0.0           0.0           0.0

##### **Method 4: Using replace() function for the whole dataframe**

In [37]:
# importing libraries
import pandas as pd
import numpy as np
  
nums = {'Student Name': [ 'Shrek', 'Shivansh', 'Ishdeep',  
                         'Siddharth', 'Nakul', 'Prakhar',
                         'Yash', 'Srikar', 'Kaustubh', 
                         'Aditya',  'Manav', 'Dubey'],
        'Roll No.': [ 18229, 18232, np.nan, 18247, 18136, 
                     np.nan, 18283, 18310, 18102, 18012,
                     18121, 18168],
        'Subject ID': [204, np.nan, 201, 105, np.nan, 204,
                       101, 101, np.nan, 165, 715, np.nan],
       'Grade Point': [9, np.nan, 7, np.nan, 8, 7, 9, 10,
                       np.nan, 9, 6, 8]}
  
# Create the dataframe
df4 = pd.DataFrame(nums)
  
# print the DataFrame
df4

   Student Name  Roll No.  Subject ID  Grade Point
0         Shrek   18229.0       204.0          9.0
1      Shivansh   18232.0         NaN          NaN
2       Ishdeep       NaN       201.0          7.0
3     Siddharth   18247.0       105.0          NaN
4         Nakul   18136.0         NaN          8.0
5       Prakhar       NaN       204.0          7.0
6          Yash   18283.0       101.0          9.0
7        Srikar   18310.0       101.0         10.0
8      Kaustubh   18102.0         NaN          NaN
9        Aditya   18012.0       165.0          9.0
10        Manav   18121.0       715.0          6.0
11        Dubey   18168.0         NaN          8.0

In [38]:
# Apply the function
df4 = df4.replace(np.nan, 0)
  
# print the DataFrame
df4

   Student Name  Roll No.  Subject ID  Grade Point
0         Shrek   18229.0       204.0          9.0
1      Shivansh   18232.0         0.0          0.0
2       Ishdeep       0.0       201.0          7.0
3     Siddharth   18247.0       105.0          0.0
4         Nakul   18136.0         0.0          8.0
5       Prakhar       0.0       204.0          7.0
6          Yash   18283.0       101.0          9.0
7        Srikar   18310.0       101.0         10.0
8      Kaustubh   18102.0         0.0          0.0
9        Aditya   18012.0       165.0          9.0
10        Manav   18121.0       715.0          6.0
11        Dubey   18168.0         0.0          8.0